In [18]:
import pandas as pd

In [19]:
data = {
    'Company' : ["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
    'Person' : ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales' : [200, 120, 340, 124, 243, 250]
 }

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    250

In [24]:
by_comp = df.groupby('Company')
by_comp.mean()

         Sales
Company
FB       246.5
GOOG     160.0
MSFT     232.0

In [14]:
by_comp.value_counts()

Company  Person   Sales
FB       Carl     243      1
         Sarah    250      1
GOOG     Charlie  120      1
         Sam      200      1
MSFT     Amy      340      1
         Vanessa  124      1
dtype: int64

In [4]:
df.groupby('Company').mean()

         Sales
Company
FB       246.5
GOOG     160.0
MSFT     232.0

In [5]:
by_comp.std()

              Sales
Company
FB         4.949747
GOOG      56.568542
MSFT     152.735065

In [6]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [7]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    250
GOOG         Sam    200
MSFT     Vanessa    340

In [8]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [17]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  246.5    4.949747  243.0  244.75  246.5  248.25  250.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [10]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   246.500000  160.000000  232.000000
      std      4.949747   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    244.750000  140.000000  178.000000
      50%    246.500000  160.000000  232.000000
      75%    248.250000  180.000000  286.000000
      max    250.000000  200.000000  340.000000

In [11]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64